<?php

use yii\db\Migration;

/**
 * Class m181112_175515_city
 */
class m181112_175515_city extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function Up()
    {
         $this->createTable('city', [
            'id' => $this->primaryKey(),
            'name' => $this->string()->notNull(),
            'code' => $this->string()->notNull(),
             
    ]);
         Yii::$app->db->createCommand()->batchInsert('city', ['code','name'], [
            ['1900000100000','Абакан'],
['6600002400000','Алапаевск'],
['5100000200000','Апатиты'],
['6602500000700','Арамиль'],
['6600300100000','Артемовский'],
['2900000100000','Архангельск'],
['6600000200000','Асбест'],
['3000000100000','Астрахань'],
['3100000100000','Белгород'],
['6600700000100','Белоярский'],
['6600000300000','Березовский'],
['6600800100000','Богданович'],
['3800000500000','Братск'],
['5300000100000','Великий Новгород'],
['6600000400000','Верхняя Пышма'],
['6600900100000','Верхняя Салда'],
['2500000100000','Владивосток'],
['3400000100000','Волгоград'],
['6100000400000','Волгодонск'],
['3400000200000','Волжский'],
['3500000100000','Вологда'],
['1100000200000','Воркута'],
['3600000100000','Воронеж'],
['8900000200000','Губкинский'],
['6600000100000','Екатеринбург'],
['6600000500000','Заречный'],
['1800000100000','Ижевск'],
['6600002900000','Ирбит'],
['3800000300000','Иркутск'],
['1600000100000','Казань'],
['3900000100000','Калининград'],
['4000000100000','Калуга'],
['6600002200000','Каменск-Уральский'],
['6600003000000','Камышлов'],
['4200000900000','Кемерово'],
['8600000200000','Когалым'],
['2300000100000','Краснодар'],
['6600001000000','Краснотурьинск'],
['6600003100000','Красноуфимск'],
['2400000100000','Красноярск'],
['4500000100000','Курган'],
['4600000100000','Курск'],
['8600000300000','Лангепас'],
['4800000100000','Липецк'],
['4001400100000','Людиново'],
['4900000100000','Магадан'],
['8600000400000','Мегион'],
['7400001000000','Миасс'],
['8900000400000','Муравленко'],
['5100000100000','Мурманск'],
['1600000200000','Набережные Челны'],
['8900000500000','Надым'],
['6600004300000','Невьянск'],
['1400000200000','Нерюнгри'],
['8600001400000','Нефтеюганск'],
['8600001100000','Нижневартовск'],
['5200000100000','Нижний Новгород'],
['6600002300000','Нижний Тагил'],
['6600001400000','Нижняя Тура'],
['4200001200000','Новокузнецк'],
['6300000300000','Новокуйбышевск'],
['2300000600000','Новороссийск'],
['5400000100000','Новосибирск'],
['8900000600000','Новый Уренгой'],
['8900000700000','Ноябрьск'],
['5500000100000','Омск'],
['5600000100000','Оренбург'],
['5600000400000','Орск'],
['6600001600000','Первоуральск'],
['5900000100000','Пермь'],
['1000000100000','Петрозаводск'],
['4100000100000','Петропавловск-Камчатский'],
['1100000500000','Печора'],
['6600001700000','Полевской'],
['6600001800000','Ревда'],
['6602100100000','Реж'],
['6100000100000','Ростов-на-Дону'],
['6200000100000','Рязань'],
['6300000100000','Самара'],
['7800000000000','Санкт-Петербург'],
['2900000400000','Северодвинск'],
['6600003400000','Серов'],
['6700000300000','Смоленск'],
['8600001000000','Сургут'],
['6602400100000','Сухой Лог'],
['6300000800000','Сызрань'],
['1100000100000','Сыктывкар'],
['6602500100000','Сысерть'],
['6100001100000','Таганрог'],
['6602400002600','Талица'],
['7200000200000','Тобольск'],
['6300000700000','Тольятти'],
['7000000100000','Томск'],
['6603000100000','Туринск'],
['7200000100000','Тюмень'],
['0300000100000','Улан-Удэ'],
['1100000700000','Усинск'],
['1100000800000','Ухта'],
['2700000100000','Хабаровск'],
['8600000100000','Ханты-Мансийск'],
['2100000100000','Чебоксары'],
['7400000100000','Челябинск'],
['3500000200000','Череповец'],
['6100001200000','Шахты'],
['8600001600000','Югорск'],
['1400000100000','Якутск'],
['7600000100000','Ярославль']
        ])->execute();

    }

    /**
     * {@inheritdoc}
     */
    public function Down()
    {
        $this->dropTable('city');
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m181112_175515_city cannot be reverted.\n";

        return false;
    }
    */
}
